CT_API/app/controllers/articles_controller.rb

  def index
    articles = Article.all
---
SELECT "articles".* FROM "articles"

  def create
    article = article_params
    article[:user_id] = current_user.id
    Article.create(article)
---
INSERT INTO "articles" ("url", "user_id", "created_at", "updated_at", "embeded") VALUES (?, ?, ?, ?, ?)  [["url", "aa"], ["user_id", 33], ["created_at", 2017-03-01 16:46:33 UTC], ["updated_at", 2017-03-01 16:46:33 UTC], ["embeded", "aa"]]

  def show
    article = Article.find(params[:id])
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]