CT_API/app/controllers/fact_checks_controller.rb

SELECT "fact_checks".* FROM "fact_checks"
---
  def index
    factChecks = FactCheck.all

INSERT INTO "fact_checks" ("claim", "evidence", "sources", "user_id", "created_at", "updated_at", "category", "article_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?)  [["claim", ""], ["evidence", ""], ["sources", ""], ["user_id", 27], ["created_at", 2017-03-01 14:05:11 UTC], ["updated_at", 2017-03-01 14:05:11 UTC], ["category", ""], ["article_id", 21]]
---
  def create
    factCheck = FactCheck.create( factCheck_params )

SELECT  "fact_checks".* FROM "fact_checks" WHERE "fact_checks"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def show
    factCheck = FactCheck.find(params[:id])